<template>
  <div class="main-wrap">
    <div class="content">
      <article class="content__element">
        <h1 class="content__element__title">Известие.</h1>
        <p class="content__element__text">
          Знакомство с 
          <popup :popupText="'Сейчас, видимо, нужно понимать как «с иностранными людьми» или как «с иностранцами». — Примечание редактора Викитеки.'">
            иностранными</popup>, по временам у нас начинавшееся, действовало тем же образом, как на чистоту русских нравов, и на вкус стола. Простые, из отечественных произведений состоявшие приготовления пищи должны были уступить чужеземным, многосложным, хотя с великими околичностями изобретенным, убыточным, многими несвойственными нам приправами набитым, но зато и вредным здоровью приготовлениям, так что даже сведение о русских блюдах почти совсем истребилось. Не можно посему представить здесь полного описания Русской Поварни, и должно будет довольствоваться только тем, что можно было собрать из оставшегося в памяти: ибо история Русской Поварни, не так как других европейских, никогда не предана была ни описанию, ни тиснению.
          Учреждение русского стола состояло в четырех подачах:
          <ol>
            <li>холодных яствах;</li>
            <li>горячих или похлебках;</li>
            <li>взварах и жареном;</li>
            <li><popup :popupText="'Слово здесь употреблено в устаревшем значении, то есть пирожное следует понимать как собирательное наименование пирогов, пирожков и тому подобных блюд (не обязательно сладких), по аналогии со словами мясное, сдобное и тому подобным. — Примечание редактора Викитеки.'"
                >в пирожном;</popup>
            </li>
          </ol>
        Великолепие столов пиршественных поставлялось не столько в изяществе, сколько в изобилии яств и множестве блюд.
        Вышеописанному понятию следуя, опишем здесь столы мясоедный и постный, разделяя оные на четыре подачи, как уже сказано.
        </p>
      </article>

      <h1 class="content__grand-title">Стол в мясоед.</h1>
      <h1 class="content__grand-title">Первая подача, содержащая холодные кушанья.</h1>
      
      <article class="content__element">
        <h1 id="okorok_vetchiny" class="content__element__title">Окорок ветчины.</h1>
        <p class="content__element__text">
          Окорок отварить в воде спело, очистить, вытереть и горячий посылать на блюде. 
          К оному подают уксус в судке, а для желающих квас в стаканах.
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Окорок свежины.</h1>
        <p class="content__element__text">Оный отварить в воде, очистить, вытереть и горячий 
          посылать на блюде; или, пообварив немного, кожу с него содрать, жир слегка надрезать в шахматы и спрыснуть солью,
           зажарить в печи. — К обоим сим приготовлениям подавать хрен, растворенный квасом или уксусом.
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Окорок буженины.</h1>
        <p class="content__element__text">
          Взяв хороший окорок свежины, то есть, свежей свинины, вымыть, вытереть, натыкать концом ножа и в эти места насовать
          чесноку, разрезав каждый зубок пополам; по отрезу окорока натереть толченым чесноком, положить 
          на сутки в глубокую посудину и налить квасом.
          К употреблению, сняв кожу, обжаривать в печи по вышесказанному о свежине. 
          К нему подавать чеснок толченый, разведенный сметаною.
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Часть солонины со сметаною и хреном.</h1>
        <p class="content__element__text">
          Часть солонины отварить в воде мягко. Когда поспеет, очистив, положить на блюдо. 
          Натертого хрену развести со сметаною, и облив оным солонину, подавать
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Полотки гусиные и утиные.</h1>
        <p class="content__element__text">
          Оные, по распластании по спине, солить впрок тем же образом, как солонину, и держать в рассоле.
          К употреблению отваривать в воде, подавать без всяких приправ, 
          а к оным уксус, или для желающих квас в стаканах.
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Поросенок со сметаною и хреном.</h1>
        <p class="content__element__text">
          Поросенка отварить в воде с солью, луковицами, укропом и чебером;
          выложить на блюдо и облить хреном, растертым со сметаною.
          <br/>
          <br/>
          Или: поросенка изжарить, разнять в части и на блюде облить хреном, растворенным на уксусе

        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Студень говяжий с чесноком.</h1>
        <p class="content__element__text">
          В этом разумеются говяжьи ноги, губы и уши.
          Очистив оные обыкновенным образом, варить в воде на умеренном огне часа два, пока сделается отвар густой и почти весь выкипит.
          Сложить тогда части студени, разняв крупные кусочки дробнее, в круглую чашу, и вылив остатки отвару, вынесть в холодное место,
          чтоб застыло. 
          Подавая, выпрокинуть студень на блюдо.
          Подавать к ней толченый чеснок, растертый со сметаною, на особливой тарелке.
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Студень свиной со сметаною и хреном.</h1>
        <p class="content__element__text">
          К оной отнимаются те же части, что и к говяжей студени. 
          Очистить оные по обыкновенному, каждую ногу разнять вдоль надвое и отварить в воде мягко.
          Впрочем не застуживая, или застудив с отваром, подавать с хреном, растворенным со сметаною
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Индейка с лимоном.</h1>
        <p class="content__element__text">
          Оную сварить в воде, или, зажарив по-обыкновенному, разнять в части, уложить на блюде, каждую часть присоединив к тому месту, 
          как находились оные в целой.
          Соленых лимонов (или, в недостатке оных, огурцов) нарезать кружочками и оными покрыть всю индейку
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Гусь или утка, обложенные огурцами.</h1>
        <p class="content__element__text">
          Оных также, сваренных в воде, или жареных, разнять в части и уложить на блюдо по вышесказанному об индейке;
          огурцов соленых очистив, изрезать в кружочки и оными покрыть гуся или утку узорами.
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Дичина под сливами.</h1>
        <p class="content__element__text">
          Тетерева или иную жареную дичину обрезать ломтиками, скласть на блюдо горкою. 
          Взять крупных слив соленых, каждую разнять пополам, косточки вынуть и укласть оными горку фигурно, 
          также и края блюда.
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Баранья голова со сметаною и хреном.</h1>
        <p class="content__element__text">
          К сему блюду присовокупляются, кроме головы, ноги и рубцы бараньи. Голову и ноги,
          опалив по обыкновению, очистить, перемыть в нескольких водах, разнять в части и по краям 
          надрезать, или скрошить в дробные полоски; после сего все сии части сварить в воде мягко. 
          Потом уши с мясистыми их частями обрезать, и концы хрящей надрезав, положить на блюдо так, 
          чтобы хрящами стояли вверх и притом рядом. Потом взломить череп, мозг осторожно вынуть, 
          очистить от перепонки, и разделив надвое, положить близ ушей. Язык распластать надвое и положить 
          рядом посредине, а около оного мягкие части от щек, из глаз вычистив черное, а потом вокруг ноги. 
          Всё это накрыть рубцами. Если рубцы не скрошены полосками, в этом случае хреном их не обливать, 
          но хрен со сметаною подавать в особливой чашечке; когда же рубцы скрошены, хреном,
          растерев с сметаною, облить всё.
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Свиная голова со сметаною и хреном.</h1>
        <p class="content__element__text">
          Голову очистив по-обыкновенному, отнять у оной нижнюю челюсть с языком, отварить в воде просто. 
          Когда сварится мягко, вытереть, глаза вынуть вон, и одну голову без прочих околичностей, положив 
          на блюдо, облить хреном, растворенным со сметаною, и подавать.
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Рубленые яйца со сметаною и чесноком, подлитые квасом.</h1>
        <p class="content__element__text">
          Яйца, сварив в густую, облупить, разрезать пополам, желтки вынуть и растереть с толченым чесноком 
          и довольною мерою сметаны, белки скрошить, положить в ту же чашу, присолить и развести квасом
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Окрошка.</h1>
        <p class="content__element__text">
          Делается оная из остатков жареного мяса разного, 
          четвероногих, птиц домовых и диких; но лучшие к сему индейка, 
          тетерев и поросенок. Обобранное мясо с костей скрошить очень дробно с луком 
          сырым, огурцами свежими или солеными, прибавить соленых слив, обрезанных с косточек; 
          смешав всё это, стоптать ложкою, смочить огуречным или сливным рассолом, с прибавкою уксусу; 
          дать постоять, и подавая, развести квасом.
        </p>
      </article>

      <h1 class="content__grand-title">ВТОРАЯ ПОДАЧА, содержащая ГОРЯЧИЕ КУШАНЬЯ ИЛИ ПОХЛЕБКИ.</h1>

      <article class="content__element">
        <h1 class="content__element__title">Щи с говяжьими голяшками.</h1>
        <p class="content__element__text">
          Говяжьи голяшки и ветчины, нарезав небольшими кусками, приставить в горшке с водою вариться. 
          Между тем кислую капусту перемыть в воде, отжать и приставить повариться особливо с малым кусочком коровьего масла. 
          Когда капуста поотварится мягко, выложить оную на сито, а потом к голяшкам в горшок прибавить 
          крошеного луку, и поставив в печь, продолжать варение, пока капуста разварится. 
          Решетного хорошего хлеба накрошить сухариками, обжарить в говяжьем сале, или масле коровьем. 
          Щи приправить немного перцом и сметаною, выложить в чашу и сухари
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Щи сборные.</h1>
        <p class="content__element__text">
          Для оных употребляется говядина, свежина, ветчина и баранина, кусками изрезанная, гусь и две курицы целых. 
          Варение производится тем же образом, как выше сказано о щах с голяшками. Так же отваривается и капуста, 
          которая обыкновенно употребляется к сему кислая, по нужде ж и свежая изрубливается крошевом. 
          Приправляются эти щи луком и сметаною.
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Щи ленивые.</h1>
        <p class="content__element__text">
          Для оных взять капусты свежей кочнями, каждый разрезать начетверо, перебрать, вымыть, и отжать, 
          варить в воде с говядиною, нарезанною кусками, и несколькими кусочками ветчины. 
          Надобно, чтобы капуста уварилась очень мягко. В приправу оных употребляется трава укропная и сметана.
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Борщ.</h1>
        <p class="content__element__text">
          Говядину кусками и немного ветчины, также целую курицу приставить вариться с водою. 
          Взять бураков обще с их травою, скрошить полосками, обжарить в масле коровьем, смочить отваром из горшка, 
          в котором варится говядина и курица; после бураки совсем выложить к говядине, приправить солью, прибавить укропу, 
          луку и уварить очень спело.
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Бураки.</h1>
        <p class="content__element__text">
          Говядины и свежины приставить вариться в горшке с водою, немного присолив. Бураки скрошив полосками,
          в сковороду положить кусок масла коровьего и крошеного луку. Когда лук почти спело прожарится, положить
          бураки и обжаривать, пока сделаются мягки; тогда бросить щепоть муки, смочить отваром от варящегося мяса; 
          приварив и вымешав, выложить к мясу, еще приварить и приправить перцем
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Осердие.</h1>
        <p class="content__element__text">
          Взять говяжье горло с присоединенными к оному легким и сердцем, вымыть, вычистить и оправить; 
          в приличных местах украсить вырезками и надрезами способом ножа. Срубить дробно говядины с луком,
          приправить солью и перцем; начинить этим горло и сердце. В горшке приставить воды и отваривать с кусками 
          говядины и корнями петрушки и пустарнаку. Когда мясо сварится и пена будет снята, мясо выбрать, 
          а положить в горшок начиненное осердие и варить. Когда поспеет, подбить легкою подпалкою.
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Лапша с курицею.</h1>
        <p class="content__element__text">
          Замесить из хорошей пшеничной муки крутое тесто на яичных желтках, раскатать оное скалкою сколько возможно тонким листом, и натерев мукою, 
          свернуть в трубку; после чего крошить ножом, с конца трубки начиная, и отрезывать полоски почти в
          толщину бумажного листа. Курицу приставить вариться в воде целую, сложив и не отнимая 
          <popup :popupText="'Крайний сустав крыла курицы. — Примечание редактора Викитеки.'">папоротков,</popup> 
          или разняв на части с кореньями и зеленью. Когда курица сварится, выложить оную; отвар процедить, и перед тем, как отпускать на стол, положить в него накрошенную лапшу, приварить и посылать с курицею
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Потрох гусиный или утиный.</h1>
        <p class="content__element__text">
          Потрох пообварить, очистить, с пупков ободрать кожу, разрезать в куски, печенки и
          головы разнять пополам, шею изрезать в куски, с лапок содрать жесткую кожу; варить 
          в воде, или на мясном отваре крепко, с прибавкою довольною крошеного луку и кореньев петрушки;
          наконец подбить легкою 
          <popup :popupText="'Мука, растертая на масле и немного поджаренная. — Примечание редактора Викитеки.'">подпалкою.</popup>
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Ушное.</h1>
        <p class="content__element__text">
          Баранью грудину, или реберные части, разняв
          в куски, варить в воде с луком и морковью, или репою скрошенными; 
          присолить и подбить легкою подпалкою
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Курица в кашице.</h1>
        <p class="content__element__text">
          Курицу разнять в части, приставить вариться в воде, с прибавкою ветчины, нарезанной 
          <popup :popupText="'По Далю: «Жеребка — отрубок, отрезок, маленький кусочек, крошка. В некоторых источниках как производная от жребия. В случае ветчины, соленых огурцов такой способ нарезки скорее ближе к кубикам.» — Примечание редактора Викитеки.'">жеребейками</popup> 
          и [12немногою долею луку крошеного. Когда курица сварится почти, засыпать гречневыми крупами и доварить. 
          Должно остерегаться, клавши крупы, чтобы не перегустить и из кашицы не сделать размазню
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Почки говяжьи, калья.</h1>
        <p class="content__element__text">
          Почки говяжьи, очищенные от сала, скрошить ломтиками; огурцов соленых, очистив кожу, накрошить жеребейками; 
          луку накрошить же. 
          Почки приставить в воде, и сварив до половины спелости, положить огурцы и лук,
          довершить варение; приправить солью и перцем.
          <br/><br/>
          Калья из свиных и бараньих почек готовится таковым же образом
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Сморчки.</h1>
        <p class="content__element__text">
          Отобрать несколько крупных сморчков, корни из них осторожно вынуть, начинить рублеными желтками в густую свареных яиц. 
          Говяжью голяшку приставить в горшке с водою, варить крепко; на этом отваре после варить чиненые сморчки, 
          с прибавкою рубленых сморчков, малой доли дробными жеребейками скрошенных ветчины и луку, укропу. 
          Когда поспеют, подавать, забелив сметаною. — Грибы 
          варят тем же образом, кроме что оных не чинят яйцами, и приправляют перцем
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Цыплята в рассольнике.</h1>
        <p class="content__element__text">
          Очистив и выпотрошив цыплят, головки им завернуть под крыло; ноги, обрубив у
          оных ногти, сложить, начинить их рублеными желтками в густую свареных яиц с укропом; 
          варить в воде с прибавкою ветчины, накрошенной жеребейками, рубленых яиц и укропу.
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Рубцы говяжьи.</h1>
        <p class="content__element__text">
          Взять говяжий сычуг, вычистить, вымывать и вымачивать в нескольких теплых водах, выскресть
          начисто, потом изрезать в полоски; приставить варить на малом огне с луком крошеным
          и налить водою; варить по крайней мере три часа, чтоб рубцы сделать
          гораздо мягки. Подавая, подбить толченым чесноком.
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Перепелки с огурцами и капустою.</h1>
        <p class="content__element__text">
          Соленых перепелок немного повымочить в квасу, приставить варить в воде. Капусту 
          кислую пообварить в воде, отжать, обжарить в масле, спрыснуть мукою и выложить к 
          варящимся перепелкам. Соленых огурцов очистить, нарезать жеребейками, 
          положить туда же и довершить варение.
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Баранье легкое в кашице.</h1>
        <p class="content__element__text">
          Баранье легкое скрошить крупными жеребейками, приставить вариться в воде, с 
          прибавкою крошеного луку; засыпать гречневыми крупами, присолить и немного приправить перцем и сметаною.
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Сычуг говяжий чиненый.</h1>
        <p class="content__element__text">
          Вычистив, вымочив, вымыв и выскребши начисто сычуг, начинить рубленым говяжьим мясом с луком, 
          приправить солью и перцем; после чего варить оный в воде, с 
          прибавкою говядины кусочками. Подавать один с отваром без кусочков говядины.
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Свиной желудок.</h1>
        <p class="content__element__text">
          Желудок, вычистив по-обыкновенному, начинить рубленым свиным мясом жирным, с прибавкою луку, соли и перцу; 
          положить в него кусок льду и зашить так плотно, чтоб воздух выходить не мог. Варить в воде с 
          прибавкою свинины, накрошенной жеребейками. Надобно смотреть того, чтоб желудок уварился мягко и притом 
          раздулся, в чем и состоит искусство повара.
        </p>
      </article>
      <article class="content__element">
        <h1 class="content__element__title">Щи зеленые из крапивы, сныти или борщу.</h1>
        <p class="content__element__text">
          Травы сии следуют весною одна по другой, и когда первая устареет, поступает в употребление другая,
          пока [15дойдет до свежей капусты и свекольных листов. Варение оных производится одинаковым образом,
          например: взять молодой крапивы, пообварить в кипятке (разумеется перебравши и ополоснув), отжать и изрубить очень дробно. 
          Между тем варить в воде говядину или баранину кусками, с прибавкою нескольких кусков ветчины. 
          В половине варения положить крапиву количеством столько, чтоб сделалось густовато. Для лучшего можно крапиву пообжарить в 
          масле и спрыснуть мукою. Когда поспеет, положить во щи яиц, свареных в густую, облупив и каждое разрезав пополам. 
          Подавать, забелив сметаною
        </p>
      </article>
      <!-- <article class="content__element">
        <h1 class="content__element__title"></h1>
        <p class="content__element__text">
        </p>
      </article> -->
    </div>
  </div>
</template>

<script>
import PopupWord from '@/components/PopupWord.vue'
import { linkHandler } from '@/data.js'

export default {
  components: {
    'popup' : PopupWord
  },
  data() {
    return {

    }
  },
  mounted: function() {
    // Создать все уникальный индектификаторы
    let titles = this.$el.querySelectorAll('.content__element__title, .content__grand-title')
    for (var i = 0; i < titles.length; i++) {
      let title_id = titles[i].innerHTML
      title_id = title_id.replace(/(\.|,)/g, '').replace(/ /g, '_').toLowerCase()
      title_id = title_id[0].toUpperCase() + title_id.slice(1)
      titles[i].id = title_id
    }

    // В ответ на linkJump ивент подсветить выбранный
    linkHandler.$on('linkJump', function(id) {
      let elem = document.getElementById(id)
      elem.classList.add("content__element__title_selected")
      setTimeout(()=>{
        elem.classList.remove("content__element__title_selected")
      }, 800)
    })
  }
};
</script>

<style lang="less">
.selected_mixin() {
  transition: 300ms;
  &_selected {
    background-color: yellow;
  }
}
.content__grand-title {
  text-align: center;
  font-weight: 100;
  text-transform: uppercase;
  font-size: 26px;
  .selected_mixin();
}

.content__element__title {
  // margin-left: 10px;
  font-size: 24px;
  text-transform: uppercase;
  .selected_mixin();
}
.content__element__text {
  font-size: 19.5px;
  // font-family: 'open sans', sans-serif;
  font-weight: 100;
}
</style>
